In [2]:
import pandas as pd
import numpy as np
%matplotlib inline

In [3]:
df = pd.read_csv('train.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# number of (rows, columns)
df.shape

(891, 12)

In [6]:
# number of rows
len(df)

891

In [7]:
# names of columns
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
# first [:N] columns by name
df['Fare'][:5]

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

In [13]:
# categorical ranges for numeric data
number_of_ranges = 14
fare_ranges = pd.cut(df['Fare'], number_of_ranges)
fare_ranges[:5]

0    (-0.512, 36.595]
1     (36.595, 73.19]
2    (-0.512, 36.595]
3     (36.595, 73.19]
4    (-0.512, 36.595]
Name: Fare, dtype: category
Categories (14, interval[float64]): [(-0.512, 36.595] < (36.595, 73.19] < (73.19, 109.785] < (109.785, 146.38] ... (365.949, 402.544] < (402.544, 439.139] < (439.139, 475.734] < (475.734, 512.329]]

In [16]:
# value counts of categorical ranges
pd.value_counts(fare_ranges)

(-0.512, 36.595]      697
(36.595, 73.19]        92
(73.19, 109.785]       53
(109.785, 146.38]      18
(146.38, 182.975]      11
(219.57, 256.165]       7
(256.165, 292.76]       6
(182.975, 219.57]       4
(475.734, 512.329]      3
(439.139, 475.734]      0
(402.544, 439.139]      0
(365.949, 402.544]      0
(329.354, 365.949]      0
(292.76, 329.354]       0
Name: Fare, dtype: int64

In [15]:
# index into first range of columns from specific row(s)
df.iloc[0, 0:3]

PassengerId    1
Survived       0
Pclass         3
Name: 0, dtype: object

In [19]:
# sort data by specific column
df.sort_values(by='Fare')[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S

In [23]:
# value counts for specific column
pd.value_counts(df['Fare'])

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
10.5000    24
7.9250     18
7.7750     16
26.5500    15
0.0000     15
7.2292     15
7.8542     13
8.6625     13
7.2500     13
7.2250     12
16.1000     9
9.5000      9
24.1500     8
15.5000     8
56.4958     7
52.0000     7
14.5000     7
14.4542     7
69.5500     7
7.0500      7
31.2750     7
46.9000     6
30.0000     6
7.7958      6
39.6875     6
           ..
9.4833      1
71.2833     1
12.8750     1
14.0000     1
7.0458      1
75.2500     1
7.7250      1
16.0000     1
32.3208     1
7.8000      1
15.0458     1
6.8583      1
8.4042      1
7.7417      1
21.6792     1
6.4500      1
7.7875      1
4.0125      1
7.3125      1
15.7500     1
33.5000     1
12.5250     1
55.4417     1
50.0000     1
6.4375      1
26.2833     1
39.4000     1
9.8458      1
8.8500      1
5.0000      1
Name: Fare, Length: 193, dtype: int64

In [25]:
# obtain datatype for every column
list(zip(df.columns, [type(x) for x in df.iloc[0, :]]))

[('PassengerId', numpy.int64),
 ('Survived', numpy.int64),
 ('Pclass', numpy.int64),
 ('Name', str),
 ('Sex', str),
 ('Age', numpy.float64),
 ('SibSp', numpy.int64),
 ('Parch', numpy.int64),
 ('Ticket', str),
 ('Fare', numpy.float64),
 ('Cabin', float),
 ('Embarked', str)]

In [26]:
# pandas method for obtaining datatypes for every column
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [29]:
# get uniques values for a column by name
df['Pclass'].unique()

array([3, 1, 2])

In [30]:
# get count of unique values of a column
len(df['Pclass'].unique())

3

In [34]:
# index into column and get first 4 rows
df.loc[0:10, 'Fare'] >= 50

0     False
1      True
2     False
3      True
4     False
5     False
6      True
7     False
8     False
9     False
10    False
Name: Fare, dtype: bool